{
  "title": "Work Experiences",
  "content": "<!--StartFragment-->\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAg7r6iiAYo26fTkgcw6wc4vwE.png.webp)](<>)\n\n**——**\n\n**May 2021 - Jan 2022 Solution Engineer, Shanghai, China**\n\n**\\>>>** Providing smart-building and smart-city level solutions and training to sales department\n\n**\\>>>** Played an active role in the projects of Nanjing Smart Building, Shanghai Fengxian District, Shanghai Airport Authority, Chengdu Yushi District etc., providing 20+ solution documents to customers\n\n**\\>>>** Performed demonstration of the North Bund CIM platform to the District Governor\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAgro_8hgYo4dDy1AIwzAg4rAI.png.webp)](<>)\n\n**——**\n\n**Feb 2021 – May 2021 BSE Intern, Shanghai, China**\n\n**\\>>>** Designed HVAC systems for Amazon SHA AWS Office with 13 drawings in AutoCAD and detailed calculation book\n\n\\>>> Worked as sustainability consultant for ICICLE Haimen Office, China, investigated the solar radiation and daylight simulation for LEED guide with Rhino Grasshopper\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAg2ZW8hgYo7OCTgwIwri44shg.png.webp)](<>)\n\n**——**\n\n**Oct 2018 – Jan 2021 Lab Assistant, Zurich, Switzerland**\n\n**\\>>>** Advised 30+ FDM printing projects both within and outside of ETHZ\n\n**\\>>>** Designed and accomplished over 35 3D-printing projects on various scales with over 15 printing materials\n\n**\\>>>** Managed over 10 FDM printers' routine maintenance, parts' fixation (mainly Raised3D and Prusa series)\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAgn5G8hgYos4LAfDClBTiPAQ.png.webp)](<>)\n\n**——**\n\n**Jul 2018 - Aug 2018 Internship Structural Analysis, Nanjing, China**\n\n**\\>>>** Performed structural analysis for Wenzhou Memorial Arch and designed geometrical dimension of building element\n\n**\\>>>** Designed the beam and pile layout plan for Sci. Tech. building, Yangzhou University according to building code with PKPM\n\n<!--EndFragment-->"
}