{
  "publishedAt": "14th Aug 2020",
  "featuredImage": "https://26808843.s21i.faiusr.com/4/ABUIABAEGAAgy6PQhgYo1KTU4AEwvQc4xAY.png.webp",
  "title": "cat",
  "content": "[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAgy6PQhgYo1KTU4AEwvQc4xAY.png.webp)](<>)\n\nOptimizing Infill-Structures for High-Performance 3D Printed Building Facades\n\n—— With the advancement of digital fabrication technologies applied in the building and construction sector, there is an unrealized potential of designing unconventional building geometries serving multiple functions. In this research thesis, three design objectives to design the infill geometry of a digitally fabricated building facade are identified: namely, structural-, thermal- and fabrication- (or printability-) performances.\\\nThe main research contribution of this study is a parallel multi-objective optimization workflow for designers to design digitally fabricated building facades. The tool is envisioned to provide designers with the flexibility to customize their designs based on self-defined performance objectives and weighing strategies.\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAg_JvQhgYo3seGpwIw5hM4kQk.png.webp)](<javascript: void(0);>)\n\n\n\n\n\n\n\n\n\n\n\n**Rhino Grasshopper Scripts >>>**\n\n- - -\n\n**Thermal & Structrual Simulation Results Visualization**\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAg_5vQhgYo0P2xjwEw9go4tAg.png.webp)](<>)\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAg_5vQhgYon8mgugMwzBg4nQs.png.webp)](<>)\n\n——\n\nParametric models of infill geometries were developed using the Axolotl volumetric modelling library created by the Digital Building Technologies (ITA, ETH) research group. The geometric parameters, boundary conditions and performance metrics are determined. To model the aforementioned performance, computational (Finite Element Method or Computational Fluid\\\nDynamics) simulations within the Rhinoceros/Grasshopper3D environment (Karamba3D, Ladybug and Butterfly) were developed. The models were supported by empirical testing where possible.\n\n[![](https://26808843.s21i.faiusr.com/4/ABUIABAEGAAg_JvQhgYoh6zj2AYwsAk4qAQ.png.webp)](<>)\n\n——\n\nAfter modelling the thermal, structural and 'printability' performance, the multi-objective design optimization problem is solved\\\nusing the genetic algorithm. The Pareto front solution is selected to develop a complete parallel multi-objective optimization work-\\\nflow as required. Prototyping with an FDM printer verifies the reliability and printability of the Axolotl-generated model. Simultaneously, the agreement between the experimentally measured data and the simulation results demonstrates the consistency and capability of the simulation tool to represent reality. To facilitate computer calculations, a simplified thermal conductivity formula is developed to account for the thermal properties of the geometry."
}